export const eventResultOptions = {
  "נפילות/חבלות": [
    "ללא תוצאה",
    "איבוד הכרה",
    "פגיעה גופנית",
    "התמוטטות"
  ],
  "ייעודי עורף/חילוץ והצלה": [
    "נזק לרכוש",
    "פגיעה גופנית",
    "פיצוץ"
  ],
  "ניווטים ומסעות": [
    "התברברות",
    "נפילה",
    "כניסה לשטח אש",
    "חריגה מג\"ג",
    "חוסר קשר",
    "דריסה",
    "התהפכות",
    "ללא תוצאה"
  ],
  "ירי דו''צ": {
    "ירי דו''צ לעבר כוחותינו":[
    "ללא תוצאה",
    "פגיעה בגוף",
    "נזק קל לרכוש",
    "פגיעה מריקושטים/נתזים"
   ],
    "ירי דו''צ לעבר אזרחים":[
      "ללא תוצאה",
    "פגיעה בגוף",
    "נזק קל לרכוש",
    "פגיעה מריקושטים/נתזים"
    ]
  },
  "דרכים": { 
    "דרכים":[
      "ללא תוצאה",
      "איבוד הכרה",
      "דליקה / שריפה",
      "דריסה",
      "המחצות אדם",
      "הרס רכוש",
      "התהפכות",
      "התנגשות",
      "חבטה/נפילה/חבלה",
      "חיתוך",
      "כוויה",
      "מכה יבשה",
      "סטייה לשול",
      "סטייה מנתיב הנסיעה",
      "פגיעה באדם",
      "פגיעה בבעל חיים",
      "פיצוץ",
      "שימוש בלתי חוקי",
      "שפ\"צ",
      "תקלה טכנית"
    ],
    "מעורבות חומ''ס": [
      "שפך/דליפה",
      "דליקה/שריפה",
      "נפילת מטען/ פריקה/העמסה",
      "הובלה ללא שילוח חומ\"ס",
      "הובלה ללא בעלי תפקידים נדרשים",
      "הובלה ללא השילוט הנדרש"
    ]
  },
  "רק''מ וצמ''ה קרביים": {
    "רק''מ וצמ''ה קרביים - רק''מ": [
      "אירוע צידוד",
      "ללא תוצאה",
      "איבוד הכרה",
      "דליקה / שריפה",
      "דריסה",
      "המחצות",
      "הרס רכוש",
      "התהפכות",
      "התנגשות",
      "חבטה/נפילה/חבלה",
      "חיתוך",
      "כוויה",
      "מכה יבשה",
      "נזק קל לרכוש",
      "נפילת ציוד",
      "נפילה ממוביל",
      "פיצוץ"
    ],
    "רק''מ וצמ''ה קרביים - צמ''ה": [
      "אירוע צידוד",
      "ללא תוצאה",
      "איבוד הכרה",
      "דליקה / שריפה",
      "דריסה",
      "המחצות",
      "הרס רכוש",
      "התהפכות",
      "התנגשות",
      "חבטה/נפילה/חבלה",
      "חיתוך",
      "כוויה",
      "מכה יבשה",
      "נזק קל לרכוש",
      "נפילת ציוד",
      "נפילה ממוביל",
      "פיצוץ",
      "שפ\"צ"
    ]
  },
  "שטח אש/מטווחים": [
    "ללא תוצאה",
    "פגיעה בגוף",
    "דליקה / שריפה",
    "נזק קל לרכוש",
    "פגיעה מריקושטים/נתזים",
    "פיצוץ"
  ],
  "חריגות ירי או תנועה של כוחות בשטחי אימונים": [
    "ללא תוצאה",
    "פגיעה בגוף",
    "דליקה / שריפה",
    "נזק קל לרכוש",
    "פגיעה מריקושטים/נתזים",
    "פיצוץ"
  ],
  "נשק ומקלעים": [
    "ללא תוצאה",
    "איבוד הכרה",
    "פגיעה גופנית",
    "דליקה / שריפה",
    "הדף",
    "הימצאות כדור בבית הבליעה",
    "התבשלות כדור",
    "ירי לא מבוקר-תקלה טכנית",
    "נזק קל לרכוש",
    "פגיעה מריקושטים/נתזים",
    "פיצוץ",
    "פליטת כדור"
  ],
  "(לא נשק ומקלעים) אמל''ח": [
    "ללא תוצאה",
    "איבוד הכרה",
    "פגיעה גופנית",
    "דליקה / שריפה",
    "הדף",
    "הימצאות תחמושת באמל\"ח (קנה)",
    "התבשלות כדור",
    "ירי לא מבוקר-תקלה טכנית",
    "פגיעה מריקושטים/נתזים",
    "פיצוץ",
    "פליטה",
    "נזק קל לרכוש"
  ],
   "אש": {
      "אש":[
        "דונם שטח שרוף",
        "הרס רכוש",
        "פגיעה משאיפת עשן",
        "פגיעה גופנית"
    ],
      "מעורבות חומ''ס הובלה":[
        "שפך/דליפה",
        "דליקה/שריפה",
        "נפילת מטען/ פריקה/העמסה",
        "הובלה ללא שילוח חומ\"ס",
        "הובלה ללא בעלי תפקידים נדרשים",
        "הובלה ללא השילוט הנדרש"
    ],
      "מעורבות חומ''ס אחסנה ושימוש":[
        "שריפת חומ\"ס",
        "שפך חומ\"ס",
        "נפילת אריזת חומ\"ס",
        "תגובה כימית של חומרים מסוכנים",
        "שתיית חומ\"ס",
        "התזת חומ\"ס לעין",
        "חשיפה עורית לחומ\"ס",
        "שאיפת אדי חומ\"ס",
        "אחסון לקוי של חומ\"ס",
        "פסולת חומ\"ס",
        "מעורבות קבלן",
        "פיצוץ/התבקעות"
    ]
  },
  "תחמושת": {
    "תחמושת":[
        "ללא תוצאה",
        "איבוד הכרה",
        "פגיעה גופנית",
        "דליקה / שריפה",
        "הדף",
        "הימצאות כדור בבית הבליעה",
        "התבשלות כדור",
        "פגיעה ברכוש",
        "נפילה של תחמושת",
        "פגיעה מריקושטים/נתזים",
        "פלטה"
    ],
      "מעורבות חומ''ס הובלה":[
        "שפך/דליפה",
        "דליקה/שריפה",
        "נפילת מטען/ פריקה/העמסה",
        "הובלה ללא שילוח חומ\"ס",
        "הובלה ללא בעלי תפקידים נדרשים",
        "הובלה ללא השילוט הנדרש"
    ],
      "מעורבות חומ''ס אחסנה ושימוש":[
        "שריפת חומ\"ס",
        "שפך חומ\"ס",
        "נפילת אריזת חומ\"ס",
        "תגובה כימית של חומרים מסוכנים",
        "שתיית חומ\"ס",
        "התזת חומ\"ס לעין",
        "חשיפה עורית לחומ\"ס",
        "שאיפת אדי חומ\"ס",
        "אחסון לקוי של חומ\"ס",
        "פסולת חומ\"ס",
        "מעורבות קבלן",
        "פיצוץ/התבקעות"
    ]
  },
  "חומ\"ס": {
    "הובלה": [
      "שפך/דליפה",
      "דליקה/שריפה",
      "נפילת מטען/ פריקה/העמסה",
      "הובלה ללא שילוח חומ\"ס",
      "הובלה ללא בעלי תפקידים נדרשים",
      "הובלה ללא השילוט הנדרש"
    ],
    "אחסנה ושימוש": [
      "שריפת חומ\"ס",
      "שפך חומ\"ס",
      "נפילת אריזת חומ\"ס",
      "תגובה כימית של חומרים מסוכנים",
      "שתיית חומ\"ס",
      "התזת חומ\"ס לעין",
      "חשיפה עורית לחומ\"ס",
      "שאיפת אדי חומ\"ס",
      "אחסון לקוי של חומ\"ס",
      "פסולת חומ\"ס",
      "מעורבות קבלן",
      "פיצוץ/התבקעות"
    ]
  },
  "שת''פ ים": {
    "צניחה": [
      "פגיעה גופנית",
      "תקלה טכנית",
      "חוסר תיאום"
    ],
    "חכ''ש":[
      "פגיעה גופנית",
      "היתפסות כבל"
    ],
    "גלישה/סנפלינג/FR": [
      "פגיעה גופנית",
      "תקלה טכנית"
    ],
    "הנחתות/המראות מכ''ש": [
      "פגיעה גופנית",
    ],
    "הגנ''א": [
      "חוסר תיאום",
      "פיצוץ"
    ],
    "רחפנים/רוכ''ש": [
      "חוסר תיאום",
      "אובדן שליטה",
      "תקלה טכנית",
      "פגיעה גופנית"
    ],
    "נחיתה":[
      "פגיעה גופנית",
      "נפילה לים",
      "טביעה"
    ],
    "סיוע": [
      "פגיעה גופנית",
    ],
    "הגנה": [
      "פגיעה גופנית",
    ],
    "אבטחת אסדה": [
      "התנגשות",
      "פגיעה גופנית",
      "חוסר תיאום"
    ],
    "אבטחת נמלים": [
      "התנגשות",
      "פגיעה גופנית",
      "חוסר תיאום"
    ],
    "שיטור ימי": [
      "התנגשות",
      "פגיעה גופנית",
      "חוסר תיאום"
    ],
  },
  "מזג-אוויר": [
    "התעלפות",
    "התמוטטות",
    "מכת חום",
    "מכת קור",
    "התייבשות",
    "היסחפות רכב",
    "היסחפות אדם"
  ],
  "ספורט ואקסטרים": [
    "נפילה מגובה נמוך/מישור",
    "התקלות באדם",
    "טביעה",
    "התחשמלות"
  ],
  "עבודה": {
    "חשמל":[
      "ללא תוצאה",
      "דליקה / שריפה",
      "התחשמלות",
      "נזק לרכוש",
      "כוויה",
      "אחר"
    ],
    "מכונות":[
      "ללא תוצאה",
      "פגיעה באדם",
      "נזק לרכוש",
      "דליקה / שריפה",
      "תגובה כימית",
      "זיהום/הרעלה",
      "חישמול"
    ],
    "קבלנים":[
      "ללא תוצאה",
      "פגיעה באדם",
      "נזק לרכוש",
      "דליקה / שריפה",
      "תגובה כימית",
      "זיהום/הרעלה",
      "קריסת מבנה או מכונה (עגורן/מכונת הרמה או חלק ממנה)",
      "התחשמלות",
      "פיצוץ",
      "דליפת גז",
      "קרינה",
      "אבק מזיק",
      "מכונה ניידת",
      "כלי עבודה",
      "כל אירוע בטיחותי במעורבות עגורן מכל סוג שהוא",
      "קריסה או נפילה של פיגום (מכל סוג שהוא)",
      "נפילת ציוד מגובה",
      "נפילת אדם מגובה",
      "תגובה כימית"
    ],
    "כשל בתשתיות":[
      "ללא תוצאה",
      "פגיעה באדם",
      "נזק לרכוש",
      "דליקה / שריפה",
      "תגובה כימית",
      "זיהום/הרעלה",
      "חישמול",
      "פיצוץ",
      "דליפת גז",
      "קרינה",
      "אבק מזיק",
      "הצפה",
      "קריסת מבנה",
      "בור/תעלה"
    ],
    "עבודה בגובה":[
      "ללא תוצאה",
      "פגיעה באדם",
      "נזק לרכוש",
      "קריסה",
      "ציוד מגן אישי - כשל בציוד, נזק לציוד, נפילה על ציוד",
      "סולמות",
      "פיגומים",
      "במות/סלים להרמת אדם",
      "התחשמלות"
    ],
    "לייזר":[
      "ללא תוצאה",
      "פגיעה באדם",
      "נזק לרכוש"
    ],
    "קרינה":[
      "ללא תוצאה",
      "פגיעה באדם",
      "נזק לרכוש"
    ],
    "מקרים אחרים שבהם חלה חובת הודעה":[
      "התבקעות אבן משחזת או דיסק השחזה",
      "התבקעות גלגל תנופה או גלגל - רצועה המוסבים בכוח מכני",
      "התבקעות מיכל או מסחט המוסבים בכוח מכני",
      "התמוטטות או נפילה של מעלית",
      "נפילת התא או הרציף שבמעלית",
      "ניתוק כבל-תיל, חבל או שרשרת המשמשים להרמה או להורדה של תא או של רציף במעלית",
      "קלקול המפסיק את הפעולה של מנגנון ההפעלה או מנגנון הבטיחות של המעלית או של חלקיהם",
      "קריסה או התמוטטות של עגורן",
      "נפילת עגורן, כננת עגורן או גלגל עגורן",
      "ניתוק כבל-תיל, חבל או שרשרת המשמשים לעגורן או המשמשים להרמה, להורדה או להובלה של מטען ע\"י עגורן, כננת או גלגלת",
      "קלקול המפסיק את הפעולה של מנגנון ההפעלה או מנגנון הבטיחות של עגורן, כננת או גלגלת או של חלקיהם",
      "התפוצצות או התבקעות של קולט גז, המכיל גז בלחץ הגבוה מלחץ האויר",
      "התפוצצות דוד קיטור וכל נזק במבנה דוד קיטור שנגרם על ידי אש חוזרת",
      "התפוצצות או שריפה שגרמו לנזק לבנין, למכונות, למתקנים, למכשירים חשמליים, או לקווי חשמל",
      "התמוטטות של פיגום המיועד לביצוע פעולות בנייה או בנייה הנדסית כמשמעותם בדין",
      "התמוטטות של תבנית ליציקת בטון, בגובה העולה על 2 מטרים"
    ],
    "מעורבות חומ''ס - הובלה":[
      "שפך/דליפה",
      "דליקה/שריפה",
      "נפילת מטען/ פריקה/העמסה",
      "הובלה ללא שילוח חומ\"ס",
      "הובלה ללא בעלי תפקידים נדרשים",
      "הובלה ללא השילוט הנדרש"
    ],
    "מעורבות חומ''ס - אחסנה ושימוש":[
      "שריפת חומ\"ס",
      "שפך חומ\"ס",
      "נפילת אריזת חומ\"ס",
      "תגובה כימית של חומרים מסוכנים",
      "שתיית חומ\"ס",
      "התזת חומ\"ס לעין",
      "חשיפה עורית לחומ\"ס",
      "שאיפת אדי חומ\"ס",
      "אחסון לקוי של חומ\"ס",
      "פסולת חומ\"ס"
    ],
    "מעורבות קבלן": [
      "פיצוץ/התבקעות"
    ]
  },
  "בטיחות ימי": {
    "צלילה":[
      "טביעה",
      "נזק לרכוש",
      "נזק לנפש",
      "אי שימוש בציוד מתאים"
    ],
    "כלי שיט": [
      "חדירת מים לא מבוקרת לספינה",
      "נזק לכ\"ש",
      "נזק לנפש",
      "תקלה במנוע",
      "נזק לרכוש",
      "הדממת מנועים",
      "נפילה למים של נפש/חפץ",
      "תקלה מערכתית בכ\"ש",
      "התנגשות כ\"ש",
      "הסחפות",
      "קריעת החבל",
      "הצפה",
      "הסתבכות חבלים",
      "כניסה לשטח אש/סגור",
      "אי שימוש בציוד מגן"
    ],
    "צניחה לים": [
      "צניחה לקרקע",
      "נזק לרכוש",
      "נזק לנפש",
      "נפילה לא מבוקרת"
    ],
    "אמל''ח ימי": [
      "פליטת אמל\"ח לים",
      "פליטת אמל\"ח ליבשה",
      "נפילת אמל\"ח למים",
      "נזק לנפש",
      "נזק לרכוש"
    ]
  },
  "טג''ח קרבי": [
    "ללא תוצאה",
    "פגיעה בגוף",
    "המחצות",
    "הרס רכוש/ציוד",
    "נפילה מגובה",
    "קריעת חבל",
    "נפילת ציוד"
  ],
  "אוויר": [
    "ללא תוצאה",
    "פגיעה בנפש",
    "פגיעה ברכוש",
    "פגיעה בנפש וברכוש",
    "נזק לכלי טיס"
  ],
  "אמצעי רוק''ק": [
    "ללא תוצאה",
    "פגיעה בנפש",
    "פגיעה ברכוש",
    "פגיעה בנפש וברכוש"
  ],
  "כושר גופני/קרבי": [
    "ללא תוצאה",
    "פגיעה בנפש בלבד"
  ]
};