export const eventFactorsOptions = {

  "נפילות/חבלות": {
    factors: [
      "היסח דעת", "החלקה", "התנגשות בחפץ", "חיפזון", "גוף זר או חפץ",
      "מגע עם גוף חם או קר", "גורמי סביבה", "חריגה מפקודות ונהלים",
      "טעות תפעול", "מאמץ יתר", "שימוש בכלי חד"
    ],
  },

  "ניווטים ומסעות": {
    factors: [
      "אנוש", "טבע", "טכני", "ציוד", "פו\"ש"
    ],
  },

  "ייעודי עורף/חילוץ והצלה": {
    factors: [
      "אנוש", "טבע", "טכני", "ציוד"
    ],
  },

  "ירי דו''צ -ירי כוחותינו לעבר כוחותינו": {
    factors: [
      "לא מובהק - תיאום לקוי", "ו/או חריגות", "מובהק - טעות בזיהוי",
        "ירי חורג מג\"ג", "ירי לא מבוקר - תקלה טכנית", "כניסה לשטח סכנה",
        "ירי ללא קו קנה-מטרה", "ירי לא מאושר", "ירי מהעומק", "ירי בזמן דילוג"
     ],
   },

  "ירי דו''צ -ירי כוחותינו לעבר אזרחים": {
    factors: [
        "לא מובהק - תיאום לקוי", "ו/או חריגות", "מובהק - טעות בזיהוי",
         "ירי חורג מג\"ג", "ירי לא מבוקר-תקלה טכנית", "כניסה לשטח סכנה",
         "ירי ללא קו קנה-מטרה", "ירי לא מאושר", "ירי מהעומק", "ירי בזמן דילוג"
     ],
   },

  "דרכים": {
    factors: [
      "אי שמירה על מרחק בטיחות", "נהיגה תחת השפעת אלכוהול או סמים",
      "היסח דעת", "איבוד שליטה על הרכב", "תקלה טכנית", "מהירות לא מותאמת",
      "סטייה מנתיב הנסיעה", "עייפות או הירדמות", "עקיפה מסוכנת",
      "תנאי דרך קשים", "ללא תוצאה מזוהה", "איבוד הכרה", "דליקה או שריפה ברכב",
      "דריסת הולך רגל", "התנגשות באדם", "הרס רכוש", "התהפכות רכב",
      "התנגשות עם עצם או רכב אחר", "חבטה, נפילה או חבלה", "חיתוך או פציעה",
      "נסיעה לאחור", "נסיעה לאחור ללא מכוון", "ירידה לשול הדרך", "מעורבות עם חומרים מסוכנים (חומ\"ס)"
    ],
  },

  "רק''מ וצמ''ה קרביים - רק''מ": {
    factors: [
      "אי שמירת מרחק", "היסח דעת", "איבוד שליטה", "כשל טכני",
      "מהירות מופרזת", "מזג אוויר", "סטייה מנתיב הנסיעה", "עייפות/ הירדמות",
      "עקיפה", "תנאי דרך", "נסיעה לאחור", "נסיעה לאחור ללא מכוון", "שימוש בלתי חוקי", "תקלה טכנית"
    ],
  },

    "רק''מ וצמ''ה קרביים - צמ''ה": {
    factors: [
      "אי שמירת מרחק", "היסח דעת", "איבוד שליטה", "כשל טכני",
      "מהירות מופרזת", "מזג אוויר", "סטייה מנתיב הנסיעה", "עייפות/ הירדמות",
      "עקיפה", "תנאי דרך", "נסיעה לאחור", "נסיעה לאחור ללא מכוון", "שימוש בלתי חוקי", "תקלה טכנית"
    ],
  },

  
  "שטח אש/מטווחים": {
    factors: [
      "כניסה לשטח סכנה", "כניסה לשטח אש ברטוב", "כניסה לשטח אש ללא תיאום",
      "כניסה לשטח אזרחי ללא תיאום", "תחילת ירי ללא דיווח הרטבה",
      "חריגות ירי בשטח אש", "ירי לא מבוקר-תקלה טכנית", "ירי חורג מג\"ג",
      "ירי ללא קו קנה-מטרה", "ירי לא מאושר", "ירי מהעומק", "ירי בזמן דילוג"
    ],
  },

  "חריגות ירי" : {
   factors: [
      "ירי חורג מג\"ג", "ירי ללא קו קנה-מטרה", "ירי לא מאושר",
      "ירי מהעומק", "ירי בזמן דילוג", "ירי לא מבוקר-תקלה טכנית"
    ],
  },
  
  "נשק ומקלעים": {
    factors: [
      "במהלך נשיאת נשק", "במהלך שיעור/ הדרכה", "משחק/עבריינות בנשק",
      "בדיקה ע\"י נשק", "בדיקה/פריקה/טעינה", "במהלך קבלת נשק",
      "טעינה/כניסה למצב היכון לירי", "ירי בתרגיל/מטווח", "ניקוי נשק", "תפעול מעצור", "תקלה טכנית"
    ],
  },

    "(לא נשק ומקלעים) אמל''ח": {
    factors: [
      "במהלך שיעור/ הדרכה", "העברת/נשיאת אמל\"ח", "משחק/עבריינות באמל\"ח",
      "בדיקה ע\"י נשק", "בדיקה/פריקה/טעינה", "במהלך קבלת אמל\"ח",
      "ירי בתרגיל/מטווח", "ניקוי אמל\"ח", "תפעול מעצור/איו\"ר", "נפילת אמל\"ח"
    ],
  },

  "אש": {
    factors: [
      "אמצעי חימום", "אסכלה (מנגל)", "בלון גז/גזייה", "דלק",
      "הצתה בזדון", "השארת/השלכת מקור חום", "חדירת מי גשמים",
      "חימום", "חיתוך/ריתוך", "ירי/אימונים", "כשל במכשור חשמלי",
      "כשל במע' חשמל במבנה", "כשל במע' חשמל ברכב", "כשל במע' מכאנית ברכב",
      "כשל במערכת הדלק ברכב", "לא ידוע", "מזגן", "משחק באש",
      "מתקן טיגון/בישול", "סוללות ליתיום", "עישון", "עמוד חשמל",
      "שריפה יזומה", "תחמושת", "מעורבות חומ\"ס - הובלה", "מעורבות חומ\"ס - אחסנה ושימוש"
    ],
  },

  "תחמושת": {
    factors: [
     "עבריינות", "תקלה טכנית", "העברת/נשיאת תחמושת", "סילוק נפל", 
     "במהלך שיעור/ הדרכה", "הפעלה לא תקינה", "ירי לא מבוקר-תקלה טכנית", 
     "ירי לא מאושר", "הפקרת תחמושת", "החסנה לקויה", "חוסר מקצועיות בהפעלה", 
     "מעורבות חומ\"ס - הובלה", "מעורבות חומ\"ס - אחסנה ושימוש" 
    ],
  },

  "חומ\"ס": {
    factors: [
      "אנוש", "טכני", "טבע"
    ],
  },

  
  "מזג-אוויר": {
    factors: [
      "עומס חום", "עומס קור", "גשם", "זרימת נחלים", "ברד"
    ],
  },

  "ספורט ואקסטרים": {
    factors: [
      "נפילות/חבלות", "חריגה מפקודות ונהלים", "פעילות אקסטרים",
       "מאמץ יתר", "גוף זר/חפץ", "גוף חם/קר"
    ],
  },

  "עבודה": {
    factors: [
      "חשמל",
      "מכונות",
      "אירוע רב משתתפים",
      "קבלנים",
      "כשל בתשתית",
      "עבודה בגובה",
      "לייזר",
      "קרינה",
      "מקרים אחרים שבהם חלה חובת הודעה",
      "מעורבות חומ''ס - הובלה",
      "מעורבות חומ''ס - אחסנה ושימוש",
      "מעורבות קבלן"
    ],
    subCategories: {
      "חשמל": {
        factors: [
          "אנוש - אדם", "אנוש - מקצועיות", "אנוש - נורמטיבי", 
          "משימה", "סביבה", "אמל\"ח", "טכני - מיכון", "טבע"
        ],
      },
      "מכונות": {
        factors: [
          "אנוש", "טכני", "טבע"
        ],
      },
      "קבלנים": {
        factors: [
          "אנוש", "טכני - מיכון/כלי עבודה/אמצעים", "אמל\"ח / ציוד"
        ],
      },
      "כשל בתשתית": {
        factors: [
          "אנוש", "טכני", "טבע"
        ],
      },
      "עבודה בגובה": {
        factors: [
          "אנוש", "טכני", "טבע"
        ],
      },
      "לייזר": {
        factors: [
          "אנוש", "טכני"
        ],
      },
      "קרינה": {
        factors: [
          "אנוש", "טכני"
        ],
      },
      "מקרים אחרים שבהם חלה חובת הודעה": {
        factors: [
          "אנוש", "טכני - מיכון/כלי עבודה/אמצעים", "אמל\"ח / ציוד"
        ],
      },
    }
  },

  "בטיחות ימי": {
    factors: [
      "אנוש", "טכני", "טבע"
    ],
  },

  "טג''ח קרבי": {
    factors: [
      "חריגה מפקודות ונהלים", "ציוד לא מותאם", "מזג אוויר", 
      "חשיפה", "היפגעות מעצמים", "ציוד בלוי", "החלשות החומר"
    ],
  },



  "חריגות ירי או תנועה של כוחות בשטחי אימונים": {
    factors: [
      "חוסר תאום",
      "שגיאת ניווט",
      "כשל בתקשורת",
      "אי מילוי נוהל",
      "אחר"
    ],
    subCategories: {
      "חוסר תאום": [
        "תאום לא מספק",
        "אי תיאום בין כוחות"
      ],
    }
  },

  'שת"פ אוויר': {
    factors: [
      "חוסר תאום",
      "כשל בתקשורת",
      "שגיאת ניווט",
      "אי מילוי נוהל",
      "אחר"
    ],
    subCategories: {
      "חוסר תאום": [
        "תאום לא מספק",
        "אי תיאום בין כוחות"
      ],
    }
  },

  "שת''פ ים": {
    factors: [
      "משימה", "אדם", "פו\"ש", "ציוד", "סביבה"
    ],
  },

  "אוויר": {
    factors: [
      "תקלה טכנית",
      "שגיאת טייס",
      "תנאי מזג אוויר",
      "אי מילוי נוהל",
      "אחר"
    ],
    subCategories: {
      "תקלה טכנית": [
        "כשל במנוע",
        "כשל במערכות",
        "תקלה מכנית"
      ],
    }
  },

  "אמצעי רוק''ק": {
    factors: [
      "תקלה טכנית",
      "שגיאת הפעלה",
      "אי מילוי נוהל",
      "חוסר הכשרה",
      "אחר"
    ],
    subCategories: {
      "תקלה טכנית": [
        "כשל במערכות",
        "תקלה מכנית"
      ],
    }
  },

  "כושר גופני/קרבי": {
    factors: [
      "מאמץ יתר",
      "חוסר חימום",
      "טכניקה שגויה",
      "תנאים לא מתאימים",
      "אחר"
    ],
    subCategories: {
      "מאמץ יתר": [
        "פעילות אינטנסיבית",
        "חוסר הכנה"
      ],
    }
  }
};

