import { Input } from "react-select/animated";

export const unitOptions = ['לוגיסטיקה', 'מודיעין', 'טכנולוגיה', 'רפואה'];

export const unitActivityOptions = [
  "תע\"ם", "אימונים", "הכשרה", "רגיעה/מנהלה", "מלחמה/מבצע צבאי נרחב"
];

export const activityOptions = [
  "פעילות מבצעית/לחימה", "אימון", "הכשרה", "שגרה", "פנאי", "חופשה"
];

export const categoryOptions = [
  "דרכים", "תחמושת", "נשק ומקלעים", "(לא נשק ומקלעים) אמל''ח", "אש", 'ירי דו"צ', "מזג-אוויר",
  'רק"מ וצמ"ה קרביים', 'שת"פ אוויר', "עבודה", "אוויר", "בטיחות ימי",
  "ספורט ואקסטרים", "נפילות/חבלות", "חריגות ירי או תנועה של כוחות בשטחי אימונים",
  'חומ"ס',  'טג"ח קרבי', 'שת"פ ים',
  "ייעודי עורף/חילוץ והצלה", "אמצעי רוק קרוב לקרקע", "כושר גופני/קרבי"
];

export const eventSeverityOptions = [
  "בחר/י", "קל", "בינוני", "חמור"
];

export const eventOutcomeOptions = [
  "א.נ.א.נ – אין נפגעים אין נזק",
  "א.נ.י.נ – אין נפגעים יש נזק", 
  "י.נ.א.נ – יש נפגעים אין נזק",
  "י.נ.י.נ – יש נפגעים יש נזק"
];

export const damageSeverityOptions = [
  "אין נזק",
  "נזק קל - קטן מ-10,000 ש\"ח",
  "נזק בינוני - גדול מ-10,000 ש\"ח וקטן מ-300,000 ש\"ח", 
  "נזק גבוה גדול מ-300,000 ש\"ח"
];

export const injurySeverityOptions = [
  "קל", "בינוני", "חמור", "קטלני"
];

export const categorySubOptions = {
  "דרכים": {
    subCategories: [
      "סיווג תאונת דרכים",
      "סוג תאונת דרכים",
      "סיווג בדרך אל/מ",
      "מקרים חריגים"
    ],
    subCategoryOptions: {
      "סיווג תאונת דרכים": [
        "הולך רגל", "דו-גלגלי מונע", "דו-גלגלי מכני", "אוטובוס/טיולית",
        "ליסינג צבאי", "מוביל/סמי", "רכב פרטי/אזרחי", " רכב רב-הינע ממוגן (דוד/זאב וכו')",
        "רכב ייעודי (אבטחה, הסעת נוסעים וכו')", "רכב לבן (שכור,ברלינגו, קנגו וכו')", "נגררים", "משא קל", "משא כבד",
        "רכב רב-הינע קל (סופה/האמר וכו')", "רכב שטח אתגרי (טרקטורון, רייזר וכו')"
      ],
      "סוג תאונת דרכים": [
        "צבא/אזרח", "צבא/צבא", "צבא/עצמי", "תאונה בחופשה",
        "דריסה - הולך רגל נדרס", "דריסה - רכב דורס", "תאונה בשירות במאפיין אזרחי"
      ],
      "סיווג בדרך אל/מ": [
        "אל העבודה", "מהעבודה", "בזמן העבודה"
      ],
      "מקרים חריגים": [
        "ביצוע נסיעה ללא אישור", "הנהג או אחד הנוסעים נמצאו לא חגורים",
        "התהפכות רכב", "נסיעה ברכב ללא רשיון מתאים או שאינו בתוקף",
        "נפילת רק\"מ/רכב ממוביל ללא התהפכות"
      ]
    }
  },

  "תחמושת": {
    subCategories: [
      "אלפ''ה",
      "פירוטכניקה",
      "חיה",
    ],
    subCategoryOptions: {
      "אלפ''ה": [
        "גומי", "גז מדמיע", "ונום", "מדוכה", "פדרל", "רוגר",
         "רומה", "רונם", "רימון הלם", "רינגו", "רמנגטון"
      ],
      "פירוטכניקה": [
        "אמונל", "גז מדמיע", "ח''ק", "חזיז",
         "עיפרון זיקוקין", "רימון עשן", "תחמושת תרגול"
      ],
      "חיה": [
        "חומרי חבלה/מטען", "טילים", "מדוכות", "מטול 40 מ''מ", "פגזים",
         "פצמ''רים", "קליעים", "רימונים", "תחמושת נ''ט", "תחמושת תרגול"
      ]
    }
  },
  
  "נשק ומקלעים": {
    subCategories: [
      "מקלעים",
      "נק''ל", 
      "נשקי אימון", 
      "אקדחים", 
      "נשק צלפים"
      ],
    subCategoryOptions: {
     "מקלעים": [
      "מא''ג חי''ר", "מא''ג חש''ן", "מק''כ 0.5",
       "מק''כ 0.5 qcb", "מקל''ר"
      ],
      "נק''ל": [
        "m-16", "פלטופ m4", "מטול m-203", "קלע a-3",
         "קלע a-4", "שוט גאן", "תבור/מיקרו תבור"
      ],
      "נשקי אימון": [
        "איירסון", "מק''ץ - מכלול קליעי"
      ],
      "אקדחים": [
        "אקדח צבאי", "אקדח אזרחי"
      ],
      "נשק צלפים": [
        "צלפים 0.338", "צלפים m-24", "צלפים בארט"
      ]
    }
  },

  "(לא נשק ומקלעים) אמל''ח": {
    subCategories: [
      "טילים",
      "מרגמות",
      "סיימון", 
      "מטול", 
      "תותחנים",
      "פגז/תותח טנק", 
      "רום קרוב לקרקע", 
      "מטאדור", 
      "רימון",
      "פיצוץ יזום", 
      "לאו", 
      "מסק''ר", 
      "יתד", 
      "אחר"
    ],
    subCategoryOptions: {
      "טילים": [
        "גיל", "הוק", "טורפדו", "כיפת ברזל", "לאו", "לאו a9",
         "מנתץ", "מפצח אגוזים", "עורב", "צ'פארל", "קנדה"
      ],
      "מרגמות": [
        "פצמ''ר 60", "פצמ''ר 81", "פצמ''ר 120"
      ],
      "רום קרוב לקרקע": [
        "בלון תצפית", "רוכ''ש", "רחפנים"
      ]
    } 
  },

  "אש": {
    subCategories: [
      "כוחות כיבוי מעורבים",
      "חקירת דליקה",
      "גרום על",
      "מאפיין אש",
      "עלויות",
      "כמות דונם שרוף",
      "סוג אש"
    ],
    subCategoryOptions: {
      "כוחות כיבוי מעורבים": [
        "צבאי", "מעורב", "אזרחי - מטוס כיבוי", "אזרחי - כב''ה"
      ],
      "חקירת דליקה": [
        "כן", "לא"
      ],
      "גורם על": [
        "אנוש", "טכני", "טבע"
      ],
      "מאפיין אש": [
        "אימונים", "בישול/טיגון", "חשמל", "מע' רכב",
        "משחק באש", "ליתיום", "עבודה חמה", "עישון",
        "הצתה בזדון", "ניסוי/בדיקה", "מדורה", "התלקחות ספונטני"
      ]
    }
  },

  "ירי דו''צ": {
    subCategories: [
    ]
  },

  
  "אוויר": {
    subCategories: [
      "תחום משני"
    ],
    subCategoryOptions: {
      "תחום משני": [
        "צניחה", "חכ\"ש", "גלישה/סנפלינג/FR", "הנחתות/המראות מכ\"ש",
        "הגנ\"א", "רחפנים/רוכ\"ש", "נחיתה", "סיוע", "הגנה",
        "אבטחת אסדה", "אבטחת נמלים", "שיטור ימי"
      ]
    }
  },

  "עבודה": {
    subCategories: ["סיווג תאונת עבודה", "סוג עבודה"],
    subCategoryOptions: {
      "סיווג תאונת עבודה": ["ישירה כתוצאה (מביצוע) העבודה", "עקיפה בזמן (העבודה)"],
      "סוג עבודה": [
        "חשמל", "מכונות", "אירוע רב משתתפים", "קבלנים", "כשל בתשתית",
        "עבודה בגובה", "לייזר", "קרינה", "רפואה/תברואה"
      ]
    }
  },
  "חומ\"ס": {
    subCategories: ["תת תחום", "סוג חומ\"ס"],
    subCategoryOptions: {
      "תת תחום": ["הובלה", "אחסנה ושימוש"],
      "סוג חומ\"ס": [
        "דלק בנזין/סולר/דלק (תעופתי)", "גפ\"מ \"גז\" (בישול)", "מסיר שומנים",
        "חומר ניקוי אקונומיקה", "תחמושת", "גז דחוס חמצן", "חומרי הדברה",
        "חומר קורוזיבי בסיסי", "סוללות ליתיום", "מדלל/מסיר צבע"
      ]
    }
  }
};

export const subSubCategoryOptions = {
 "חשמל": [
  "אמצעי חימום/קירור", "לוח חשמל", "תאורה"
],
  "מע' רכב": [
    "אחר-אופנוע", "אחר-מלגזה", "משא", "משא-אושקוש", "משא-זאב",
    "משא-פורד", "נוסעים-אוטובוס", "נוסעים-ליסינג", "רבהנע-דוד", 
    "רב הנע-דימקס", "רב הנע-האמר", "רב הנע-סופה", "רב הנע-פורד בולנס",
    "רב הנע-רנגלר", "רק''מ/צמ''ה", "רק''מ/צמ''ה-d9", 
    "רק''מ/צמ''ה- אכזרית", "רק''מ/צמ''ה- נגמחון"
  ]
};